GreatCowBASIC/DATFileGenerator/incfiles/p16F17576.inc
;----- CM1CON1 Bits -----------------------------------------------------
INTN_CM1CON1     EQU  H'0000'
INTP_CM1CON1     EQU  H'0001'
RDY              EQU  H'0007'
C1INTN           EQU  H'0000'
C1INTP           EQU  H'0001'
C1RDY            EQU  H'0007'
SP0              EQU  H'0002'
C1SP0            EQU  H'0002'


;----- CM1NCH Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
C1NCH0           EQU  H'0000'
C1NCH1           EQU  H'0001'
C1NCH2           EQU  H'0002'


;----- CM1PCH Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
C1PCH0           EQU  H'0000'
C1PCH1           EQU  H'0001'
C1PCH2           EQU  H'0002'


;----- CMLP1CON0 Bits -----------------------------------------------------
SYNC_CMLP1CON0   EQU  H'0000'
POL_CMLP1CON0    EQU  H'0004'
OUT_CMLP1CON0    EQU  H'0006'
EN               EQU  H'0007'
CLP1SYNC         EQU  H'0000'
CLP1POL          EQU  H'0004'
CLP1OUT          EQU  H'0006'
CLP1EN           EQU  H'0007'


;----- CMLP1CON1 Bits -----------------------------------------------------
INTN_CMLP1CON1   EQU  H'0000'
INTP_CMLP1CON1   EQU  H'0001'
CLP1INTN         EQU  H'0000'
CLP1INTP         EQU  H'0001'
CMR0             EQU  H'0004'
CMR1             EQU  H'0005'
CLP1CMR0         EQU  H'0004'
CLP1CMR1         EQU  H'0005'


;----- CMLP1NCH Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
CLP1NCH0         EQU  H'0000'
CLP1NCH1         EQU  H'0001'
CLP1NCH2         EQU  H'0002'


;----- CMLP1PCH Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
CLP1PCH0         EQU  H'0000'
CLP1PCH1         EQU  H'0001'
CLP1PCH2         EQU  H'0002'


;----- CMOUT Bits -----------------------------------------------------
C1OUT_CMOUT      EQU  H'0000'
CLP1OUT          EQU  H'0001'


;----- DAC2CON Bits -----------------------------------------------------
NSS              EQU  H'0000'
REFRNG           EQU  H'0006'
EN               EQU  H'0007'
PSS0             EQU  H'0002'
PSS1             EQU  H'0003'
OE0              EQU  H'0004'
OE1              EQU  H'0005'


;----- OPA2CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA2UG           EQU  H'0003'
OPA2EN           EQU  H'0007'


;----- OPA2CON1 Bits -----------------------------------------------------
RESON            EQU  H'0003'
NSS0             EQU  H'0000'
NSS1             EQU  H'0001'
NSS2             EQU  H'0002'
GSEL0            EQU  H'0004'
GSEL1            EQU  H'0005'
GSEL2            EQU  H'0006'
OPA2RESON        EQU  H'0003'
OPA2NSS0         EQU  H'0000'
OPA2NSS1         EQU  H'0001'
OPA2NSS2         EQU  H'0002'
OPA2GSEL0        EQU  H'0004'
OPA2GSEL1        EQU  H'0005'
OPA2GSEL2        EQU  H'0006'


;----- OPA2CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'
FMS0             EQU  H'0006'
FMS1             EQU  H'0007'
OPA2PCH0         EQU  H'0000'
OPA2PCH1         EQU  H'0001'
OPA2PCH2         EQU  H'0002'
OPA2PCH3         EQU  H'0003'
OPA2FMS0         EQU  H'0006'
OPA2FMS1         EQU  H'0007'


;----- OPA2CON3 Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
NCH3             EQU  H'0003'
OPA2NCH0         EQU  H'0000'
OPA2NCH1         EQU  H'0001'
OPA2NCH2         EQU  H'0002'
OPA2NCH3         EQU  H'0003'


;----- OPA2OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA2OFFSET0      EQU  H'0000'
OPA2OFFSET1      EQU  H'0001'
OPA2OFFSET2      EQU  H'0002'
OPA2OFFSET3      EQU  H'0003'
OPA2OFFSET4      EQU  H'0004'
OPA2OFFSET5      EQU  H'0005'
OPA2OFFSET6      EQU  H'0006'
OPA2OFFSET7      EQU  H'0007'


;----- OPA2CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA2OFCST        EQU  H'0002'
OPA2OFCSEL0      EQU  H'0000'
OPA2OFCSEL1      EQU  H'0001'


;----- OPA4CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA4UG           EQU  H'0003'
OPA4EN           EQU  H'0007'


;----- OPA4CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
OPA4PCH0         EQU  H'0000'
OPA4PCH1         EQU  H'0001'
OPA4PCH2         EQU  H'0002'


;----- OPA4CON3 Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
OPA4NCH0         EQU  H'0000'
OPA4NCH1         EQU  H'0001'
OPA4NCH2         EQU  H'0002'


;----- OPA4OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA4OFFSET0      EQU  H'0000'
OPA4OFFSET1      EQU  H'0001'
OPA4OFFSET2      EQU  H'0002'
OPA4OFFSET3      EQU  H'0003'
OPA4OFFSET4      EQU  H'0004'
OPA4OFFSET5      EQU  H'0005'
OPA4OFFSET6      EQU  H'0006'
OPA4OFFSET7      EQU  H'0007'


;----- OPA4CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA4OFCST        EQU  H'0002'
OPA4OFCSEL0      EQU  H'0000'
OPA4OFCSEL1      EQU  H'0001'


;----- OPA3CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA3UG           EQU  H'0003'
OPA3EN           EQU  H'0007'


;----- OPA3CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
OPA3PCH0         EQU  H'0000'
OPA3PCH1         EQU  H'0001'
OPA3PCH2         EQU  H'0002'


;----- OPA3CON3 Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
OPA3NCH0         EQU  H'0000'
OPA3NCH1         EQU  H'0001'
OPA3NCH2         EQU  H'0002'


;----- OPA3OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA3OFFSET0      EQU  H'0000'
OPA3OFFSET1      EQU  H'0001'
OPA3OFFSET2      EQU  H'0002'
OPA3OFFSET3      EQU  H'0003'
OPA3OFFSET4      EQU  H'0004'
OPA3OFFSET5      EQU  H'0005'
OPA3OFFSET6      EQU  H'0006'
OPA3OFFSET7      EQU  H'0007'


;----- OPA3CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA3OFCST        EQU  H'0002'
OPA3OFCSEL0      EQU  H'0000'
OPA3OFCSEL1      EQU  H'0001'


;----- NVMADR Bits -----------------------------------------------------
NVMADR0          EQU  H'0000'
NVMADR1          EQU  H'0001'
NVMADR2          EQU  H'0002'
NVMADR3          EQU  H'0003'
NVMADR4          EQU  H'0004'
NVMADR5          EQU  H'0005'
NVMADR6          EQU  H'0006'
NVMADR7          EQU  H'0007'


;----- NVMADRH Bits -----------------------------------------------------
NVMADR8          EQU  H'0000'
NVMADR9          EQU  H'0001'
NVMADR10         EQU  H'0002'
NVMADR11         EQU  H'0003'
NVMADR12         EQU  H'0004'
NVMADR13         EQU  H'0005'
NVMADR14         EQU  H'0006'


;----- NVMDAT Bits -----------------------------------------------------
NVMDAT0          EQU  H'0000'
NVMDAT1          EQU  H'0001'
NVMDAT2          EQU  H'0002'
NVMDAT3          EQU  H'0003'
NVMDAT4          EQU  H'0004'
NVMDAT5          EQU  H'0005'
NVMDAT6          EQU  H'0006'
NVMDAT7          EQU  H'0007'


;----- NVMDATH Bits -----------------------------------------------------
NVMDAT8          EQU  H'0000'
NVMDAT9          EQU  H'0001'
NVMDAT10         EQU  H'0002'
NVMDAT11         EQU  H'0003'
NVMDAT12         EQU  H'0004'
NVMDAT13         EQU  H'0005'


;----- NVMCON1 Bits -----------------------------------------------------
RD               EQU  H'0000'
WR               EQU  H'0001'
WREN             EQU  H'0002'
WRERR            EQU  H'0003'
FREE             EQU  H'0004'
LWLO             EQU  H'0005'
NVMREGS          EQU  H'0006'


;----- SCANCON0 Bits -----------------------------------------------------
INTM             EQU  H'0003'
DABORT           EQU  H'0004'
BUSY             EQU  H'0005'
SGO              EQU  H'0006'
EN               EQU  H'0007'


