GreatCowBASIC/DATFileGenerator/incfiles/p16F17576.inc
;----- RC3I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RC4I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RD0I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RD1I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- PORTW Bits -----------------------------------------------------
RW0              EQU  H'0000'
RW1              EQU  H'0001'
RW2              EQU  H'0002'
RW3              EQU  H'0003'
RW4              EQU  H'0004'
RW5              EQU  H'0005'
RW6              EQU  H'0006'
RW7              EQU  H'0007'


;----- LATW Bits -----------------------------------------------------
LATW0            EQU  H'0000'
LATW1            EQU  H'0001'
LATW2            EQU  H'0002'
LATW3            EQU  H'0003'
LATW4            EQU  H'0004'
LATW5            EQU  H'0005'
LATW6            EQU  H'0006'
LATW7            EQU  H'0007'


;----- PORTWIN0 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN2 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN3 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN4 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN5 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN6 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN7 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
CLK5             EQU  H'0005'
CLK6             EQU  H'0006'
CLK7             EQU  H'0007'


;----- PORTWDF Bits -----------------------------------------------------
DF0              EQU  H'0000'
DF1              EQU  H'0001'
DF2              EQU  H'0002'
DF3              EQU  H'0003'
DF4              EQU  H'0004'
DF5              EQU  H'0005'
DF6              EQU  H'0006'
DF7              EQU  H'0007'
PWDF0            EQU  H'0000'
PWDF1            EQU  H'0001'
PWDF2            EQU  H'0002'
PWDF3            EQU  H'0003'
PWDF4            EQU  H'0004'
PWDF5            EQU  H'0005'
PWDF6            EQU  H'0006'
PWDF7            EQU  H'0007'


;----- PORTWCON Bits -----------------------------------------------------
CLKEN            EQU  H'0000'
CPOL             EQU  H'0004'
PWCLKEN          EQU  H'0000'
PWCPOL           EQU  H'0004'


;----- APMCON Bits -----------------------------------------------------
EN               EQU  H'0007'
APMEN            EQU  H'0007'


;----- APMPRE Bits -----------------------------------------------------
PRE0             EQU  H'0000'
PRE1             EQU  H'0001'
PRE2             EQU  H'0002'
PRE3             EQU  H'0003'
PRE4             EQU  H'0004'
PRE5             EQU  H'0005'
PRE6             EQU  H'0006'
PRE7             EQU  H'0007'
APMPRE0          EQU  H'0000'
APMPRE1          EQU  H'0001'
APMPRE2          EQU  H'0002'
APMPRE3          EQU  H'0003'
APMPRE4          EQU  H'0004'
APMPRE5          EQU  H'0005'
APMPRE6          EQU  H'0006'
APMPRE7          EQU  H'0007'


;----- APMPREH Bits -----------------------------------------------------
PRE8             EQU  H'0000'
PRE9             EQU  H'0001'
PRE10            EQU  H'0002'
PRE11            EQU  H'0003'
PRE12            EQU  H'0004'
PRE13            EQU  H'0005'
PRE14            EQU  H'0006'
PRE15            EQU  H'0007'
APMPRE8          EQU  H'0000'
APMPRE9          EQU  H'0001'
APMPRE10         EQU  H'0002'
APMPRE11         EQU  H'0003'
APMPRE12         EQU  H'0004'
APMPRE13         EQU  H'0005'
APMPRE14         EQU  H'0006'
APMPRE15         EQU  H'0007'


;----- APMPER Bits -----------------------------------------------------
PER0             EQU  H'0000'
PER1             EQU  H'0001'
PER2             EQU  H'0002'
PER3             EQU  H'0003'
PER4             EQU  H'0004'
PER5             EQU  H'0005'
PER6             EQU  H'0006'
PER7             EQU  H'0007'
APMPER0          EQU  H'0000'
APMPER1          EQU  H'0001'
APMPER2          EQU  H'0002'
APMPER3          EQU  H'0003'
APMPER4          EQU  H'0004'
APMPER5          EQU  H'0005'
APMPER6          EQU  H'0006'
APMPER7          EQU  H'0007'


;----- APMPERH Bits -----------------------------------------------------
PER8             EQU  H'0000'
PER9             EQU  H'0001'
PER10            EQU  H'0002'
PER11            EQU  H'0003'
PER12            EQU  H'0004'
PER13            EQU  H'0005'
PER14            EQU  H'0006'
PER15            EQU  H'0007'
APMPER8          EQU  H'0000'
APMPER9          EQU  H'0001'
APMPER10         EQU  H'0002'
APMPER11         EQU  H'0003'
APMPER12         EQU  H'0004'
APMPER13         EQU  H'0005'
APMPER14         EQU  H'0006'
APMPER15         EQU  H'0007'


;----- APMPERS2 Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'


;----- APMPERS2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'


;----- APMPERS2U Bits -----------------------------------------------------
OPA3             EQU  H'0000'
OPA4             EQU  H'0001'
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


